import type { TeamMember } from '~/types/member'

export const members: TeamMember[] = [
  {
    id: 1,
    fullName: 'Левин Никита',
    age: 13,
    hobbies: 'Футбол, робототехника, мультстудия',
    games: 'World of Tanks, Mobile Legends: Bang Bang, Яндекс.Игры',
    summer: 'Все лето гулял. Сломал руку со смещением, теперь во мне две спицы',
    expectations: 'Ожидал от команды то, что какие-то рандомы. Но оказалось, что это Мега гипер сигмы'
  },
  {
    id: 2,
    fullName: 'Савельев Никита',
    age: 12,
    hobbies: 'Робототехника, шахматы, олимпиадная математика (все эти хобби я очень люблю 😊)',
    games: 'Настольные игры: Мафия или детективное. Так же люблю компьютерные игры такие как Minecraft...',
    summer: 'Я очень хорошо провел лето. Побывал во многих городах такие как Санкт-Петербург, Москва, Калининград, Зеленоградск (каждый город интересный и потрясающий)',
    expectations: 'Я ожидал, что все ребята будут дружные и добрые и с командой будет приятно проводить время. В реальности так и оказалось'
  },
  {
    id: 3,
    fullName: 'Забаранилов Дима',
    age: 11,
    hobbies: 'Мое хобби это робототехника и программирование. Ещё я изучаю английский и китайский языки',
    games: 'Часто играю в Roblox и Minecraft',
    summer: 'Летом я ездил в Нижний Новгород, там посетил Нижегородский Кремль, погулял по Покровской улице, прогулялся по набережной и спустился по Чкалоской лестнице. Посетил Нежегородский зоопарк. Оставшееся время каникул провел в деревне. Ходил на рыбалку и в лес за грибами.',
    expectations: 'Ожидания были не очень, но все оказалось намного лучше, мы начали сплочаться'
  },
  {
    id: 4,
    fullName: 'Анисимов Марк',
    age: 12,
    hobbies: 'Олимпиадная математика, робототехника',
    games: 'Formula 1 2013, Dungeons & Dragons',
    summer: 'Выиграл RRO 2025 в Мурманске, съездил в ФеДУТС',
    expectations: 'Ожидания: быстрый старт работы. Реальность: долгое "вкатывание" в работу'
  },
  {
    id: 5,
    fullName: 'Хистиев Александр',
    age: 13,
    hobbies: 'Увлекаюсь Формулой 1 и болею за команду Red Bull',
    games: 'Играю в CS2, Formula 1 2025, GTA 5',
    summer: 'Со своим проектом по плотинам вышел на региональный этап в Свердловской области. Занял 2 место в математических боях в высшей лиге.',
    expectations: '-'
  },
  {
    id: 6,
    fullName: 'Веретенников Егор',
    age: 11,
    hobbies: 'Настольные игры: энергосеть, 7 чудес, колонизаторы',
    games: 'Майнкрафт, Роблокс',
    summer: 'Море, дача, день рождения',
    expectations: 'Ожидания: я себе ничего не представлял. Реальность: много работы и все свое свободное время тратить на работу'
  },
  {
    id: 7,
    fullName: 'Крапивин Григорий',
    age: 11,
    hobbies: 'Тафтинг, рисование',
    games: 'Майнкрафт, TankBlits, Roblox',
    summer: 'Ездил в Санкт-Петербург, посетил Аврору, Петергоф и магазин Castle Rock. На корабле встречали развод мостов. А так же отдыхал в деревне: пилил дрова, гонял на велосипеде',
    expectations: 'Быстрый въезд в работу. Так и получилось'
  }
]

